const company = [
  {
    id: 0,
    name: "猛犸电动 / 猛犸充电 / 充电网",
    job: "前端开发工程师",
    time: "2018.09 - 至今",
    image: "mengma.png",
    cominfo: "公司名称为深圳智链物联科技有限公司，包含猛犸电动车、猛犸充电桩及充电网三个品牌。我负责猛犸电动及猛犸充电的相关业务开发。技术涉及了Vue、小程序、Nuxt。项目包含了用户端（微信/支付宝小程序、H5活动页面）、商户端（微信/支付宝公众号、PC端）。"
  },{
    id: 1,
    name: "广州赛意信息科技股份有限公司",
    job: "前端开发工程师",
    time: "2016.03 - 2018.09",
    image: "sie.png",
    cominfo: "华为项目，日志分析云项目组。负责日志分析云项目的前端页面开发。技术涵盖了Hae及Vui框架，主要功能模块包含日志搜索、应用概览、调用链、货品管理等。将接入进来的海量日志进行分析处理展示，为用户提供优异的操作体验。"
  },{
    id: 1,
    name: "乐目三防",
    job: "产品外观设计师",
    time: "2016.03之前",
    image: "lm.png",
    cominfo: "公司主要从事户外三防手机及移动电源相关产品的生产销售。负责产品外观设计相关的工作。"
  }
]


module.exports = {
  company
}