const myworks = [
  {
    id: 1,
    name: "猛犸精选-微信小程序",
    type: 1,   //1:小程序，  2:移动端   3:PC端   4:H5页面
    logo: "mengma.png",
    appid: "wx3b103843be52ee0f",
    dec: "该小程序主要面向C端用户，为公司电动车的销售进行拉流作用。主要职责是搭建项目，完成每期需求迭代，包括抽奖活动、门店地图、商品预购、商城订单、故事墙等",
    skills: [
      "① 使用分包管理及oss图片，优化加载速度",
      "② image-cropper实现小程序图片裁剪",
      "③ 使用canvas画图，生成推广海报",
      "④ 使用weapp-qrcode生成页面中的二维码",
      "⑤ map组件实现地图页面及气泡展示",
      "⑥ 利用tranform完成特定UI图片轮播",
      "⑦ 通过腾讯地图api实现逆地理位置解析",
      "⑧ 自定义组件实现转盘抽奖功能",
      "⑨ 配置扫码普通链接二维码打开小程序"
    ]
  },{
    id: 2,
    name: "闪购Lite-直播微信小程序",
    type: 1,   //1:小程序，  2:移动端   3:PC端   4:H5页面
    logo: "lite.png",
    appid: "wx24144b4900e70f76",
    dec: "用户端项目，基于腾讯看点直播平台，小程序内嵌H5直播。可以直播卖货，包括猛犸电动车及其他多种商品。主要职责是搭建项目，根据UI完成页面交互，与腾讯相关人员对接，引入直播画面。",
    skills: [
      "① navigationStyle实现顶部导航栏自定义",
      "② 自定义组件及template实现组件的公用",
      "③ webview组件实现跳转到H5页面功能",
      "④ 通过navigator实现小程序之间跳转",
      "⑤ js-md5实现跟后台交互时的验签功能",
      "⑥ 使用git完成项目版本控制",
      "⑦ 使用less完成css编译",
      "⑧ 实现分享、关注、联系客服功能"
    ]
  },{
    id: 3,
    name: "猛犸掌柜-支付宝小程序",
    type: 1,   //1:小程序，  2:移动端   3:PC端   4:H5页面
    logo: "mengma.png",
    appid: "",
    dec: "为猛犸电动B端商户提供一个用来收款、收入统计及核销奖券等相关功能的小程序。主要职责是负责门店入住、网商开户、销售订单等相关功能及小换电柜相关业务的开发。",
    skills: [
      "① 使用分包管理及oss图片，优化加载速度",
      "② 引入扩展组件并修改源码",
      "③ webview组件实现跳转到H5页面",
      "④ git实现代码管理",
      "⑤ 通过自定义组件实现公共组件编写",
      "⑥ 使用级联组件完成城市选择",
      "⑦ 引入ionfont图标，减少图片请求"
    ]
  },{
    id: 4,
    name: "共享充电商户平台-微信公众号",
    type: 2,   //1:小程序，  2:移动端   3:PC端   4:H5页面
    logo: "gongxiang.png",
    appid: "",
    dec: "猛犸充电商户端项目，为物业或代理商提供收入统计、充电桩管理、站点管理、对账单查询、远程充电等相关功能。主要负责项目构建、完成需求迭代。",
    skills: [
      "① Vue项目构建，webpack相关配置",
      "② 按需引入Vux组件，实现v-chart等功能",
      "③ 引入微信JSSDK，实现扫码、定位等功能",
      "④ qrcode实现生成二维码功能",
      "⑤ git实现代码管理",
      "⑥ cross-env设置环境变量，跨域获取数据",
      "⑦ vuex实现数据缓存功能"
    ]
  },{
    id: 5,
    name: "小电驴-支付宝公众号",
    type: 2,   //1:小程序，  2:移动端   3:PC端   4:H5页面
    logo: "xiaodianlv.jpeg",
    appid: "",
    dec: '天能电池、支付宝、猛犸充电三方合作的一次营销活动项目，投线下广告，用户扫码后进入"小电驴"生活号进行抽奖核销。主要工作是门店信息录入，门店核销等相关开发。',
    skills: [
      "① Vue项目构建，webpack相关配置",
      "② 按需引入Vux UI组件",
      "③ 引入支付宝JSAPI，实现扫码、定位等功能",
      "④ 配置rem.js实现rem弹性布局",
      "⑤ axios获取后台数据",
      "⑥ 路由导航守卫实现页面切换的逻辑处理"
    ]
  },{
    id: 6,
    name: "E10换电柜运营管理平台-PC端",
    type: 3,   //1:小程序，  2:移动端   3:PC端   4:H5页面
    logo: "mengma_charge.png",
    appid: "",
    dec: "换电柜商户端项目，为商户提供营收统计，站点管理，换电柜管理，卡片管理等相关功能。主要职责是构建及维护项目，为商户提供技术支持。",
    skills: [
      "① Vue+webpack构建项目",
      "② 按需引入Element UI组件",
      "③ 结合权限中心，实现单点登录",
      "④ 引入高德地图api，实现地图功能",
      "⑤ 路由懒加载及gzip压缩优化首屏加载速度",
      "⑥ 引入echarts实现图表展示",
      "⑦ 引入moment进行时间格式转换"
    ]
  },{
    id: 7,
    name: "猛犸充电商户端-PC端",
    type: 3,   //1:小程序，  2:移动端   3:PC端   4:H5页面
    logo: "mengma_charge.png",
    appid: "",
    dec: "猛犸充电商户端项目，为商户提供营收统计，社区管理，银行卡管理，停车记录等相关功能。主要职责是需求迭代及项目维护。",
    skills: [
      "① echarts饼图展示分润比例控制",
      "② 支付宝扫码支付完成费用欠扣功能",
      "③ 引入videoJS播放摄像头视频",
      "④ 使用filters实现字段过滤",
      "⑤ 公共js实现权限控制",
      "⑥ sessionStorage实现数据缓存",
      "⑦ 引入moment进行时间格式转换"
    ]
  },{
    id: 8,
    name: "精选抽奖H5-微信/支付宝H5",
    type: 4,   //1:小程序，  2:移动端   3:PC端   4:H5页面
    logo: "mengma.png",
    appid: "",
    dec: '通过线上充电小程序(微信/支付宝)等以广告形式提供入口，提高引流活动转化率。负责整个项目的开发。',
    skills: [
      "① 使用腾讯地图api获取城市中心点坐标",
      "② 引入小程序转盘抽奖组件并修改源码",
      "③ 实现上拉加载更多门店信息",
      "④ 引入拼图js实现拼图验证功能",
      "⑤ vux的Previewer组件实现多图预览"
    ]
  },{
    id: 9,
    name: "答题H5-微信/支付宝H5",
    type: 4,   //1:小程序，  2:移动端   3:PC端   4:H5页面
    logo: "mengma.png",
    appid: "",
    dec: '为猛犸电动售车进行预热。用户点击选项进行答题，提交全部答案后跳转抽奖链接进行抽奖。负责整个项目的开发。',
    skills: [
      "① Vue+webpack构建项目",
      "② 计时器功能实现验证码获取",
      "③ 实现自定义进度条交互",
      "④ 配置rem.js实现rem弹性布局",
      "⑤ 使用less进行css编译",
      "⑥ canvas绘图保存勋章墙页面"
    ]
  },{
    id: 10,
    name: "买车送充电-微信/支付宝H5",
    type: 4,   //1:小程序，  2:移动端   3:PC端   4:H5页面
    logo: "mengma.png",
    appid: "",
    dec: '为猛犸电动新车上市销售造势，结合推广返佣形式，调用代理商积极性，促进充电场景电动车交易达成。负责整个项目的开发。',
    skills: [
      "① Vue+webpack构建项目",
      "② 兼容微信及支付宝平台",
      "③ 解决了IOS键盘顶起页面问题",
      "④ 高德地图api逆地理编码获取城市code",
      "⑤ 使用less进行css编译"
    ]
  }
]

module.exports = {
  myworks
}